STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.USBDongle/Applications/Thread/Thread_Coap_DataTransfer/STM32_WPAN/App/app_thread.c
  if (SHCI_GetWirelessFwInfo(p_wireless_info) != SHCI_Success)
  {
    APP_THREAD_Error((uint32_t)ERR_THREAD_CHECK_WIRELESS, (uint32_t)ERR_INTERFACE_FATAL);
  }
  else
  {
    APP_DBG("**********************************************************");
    APP_DBG("WIRELESS COPROCESSOR FW:");
    /* Print version */
    APP_DBG("VERSION ID = %d.%d.%d", p_wireless_info->VersionMajor, p_wireless_info->VersionMinor, p_wireless_info->VersionSub);

    switch(p_wireless_info->StackType)
    {
    case INFO_STACK_TYPE_THREAD_FTD :
      APP_DBG("FW Type : Thread FTD");
      break;
    case INFO_STACK_TYPE_THREAD_MTD :
      APP_DBG("FW Type : Thread MTD");
      break;
    case INFO_STACK_TYPE_BLE_THREAD_FTD_STATIC :
      APP_DBG("FW Type : Static Concurrent Mode BLE/Thread");
      break;
    default :
      /* No Thread device supported ! */
      APP_THREAD_Error((uint32_t)ERR_THREAD_CHECK_WIRELESS, (uint32_t)ERR_INTERFACE_FATAL);
      break;
    }
    APP_DBG("**********************************************************");
  }
}
/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */
/**
 * @brief  This function is used to compare the message received versus
 *     the original message.
 * @param  None
 * @retval None
 */
static void APP_THREAD_CheckMsgValidity(void)
{
  uint16_t mMsgId=OT_BufferIdRead - 1U; /* Corrected MsgId (MsgId starts at 1, not at 0) */
  uint32_t mOffset = COAP_PAYLOAD_MAX_LENGTH*mMsgId; /* the starting offset */
  uint32_t i;
  bool valid =true;

  for(i = mOffset; i < mOffset+COAP_PAYLOAD_MAX_LENGTH; i++)
  {
    if(OT_BufferReceived[i-mOffset] != aDataBuffer[i])
    {
      valid =false;
    }
  }

  if(valid == false)
    APP_THREAD_Error(ERR_MSG_COMPARE_FAILED, 0);
}

/**
 * @brief  This function compute the next message to be send
 * @param  None
 * @retval None
 */
static void APP_THREAD_SendNextBuffer(void)
{
  uint16_t j;
  uint16_t mOffset;

  APP_DBG("+++ APP_THREAD_SendNextBuffer ID : %d +++", OT_BufferIdSend);
  if (OT_BufferIdSend < 5U)
  {
    /* Prepare next buffers to be send */
    OT_BufferIdSend++;
    mOffset=(OT_BufferIdSend - 1U) * COAP_PAYLOAD_MAX_LENGTH;

    memset(OT_BufferSend, 0, COAP_PAYLOAD_MAX_LENGTH);
    for(j = mOffset; j < mOffset + COAP_PAYLOAD_MAX_LENGTH; j++)
    {
      OT_BufferSend[j - mOffset] = aDataBuffer[j];
    }

    /* Send the data in unicast mode */
    APP_THREAD_CoapSendRequest(&OT_RessourceDataTransfer,
        OT_COAP_TYPE_CONFIRMABLE,
        OT_COAP_CODE_PUT,
        NULL,
        &OT_PeerAddress,
        OT_BufferSend,
        sizeof(OT_BufferSend),
        &APP_THREAD_DataRespHandler,
        NULL);
  }
  else
  {
    /* Buffer transfer has been successfully  transferred */
    BSP_LED_On(LED1);
    APP_DBG("********* BUFFER HAS BEEN TRANSFERRED *********");
  }
}

/**
 * @brief Data request handler triggered at the reception of the COAP message
 * @param pContext : Context
 * @param pHeader header pointer
 * @param pMessage message pointer
 * @param pMessageInfo message info pointer
 * @retval None
 */
static void APP_THREAD_CoapDataReqHandler(void                * pContext,
                                          otMessage           * pMessage,
                                          const otMessageInfo * pMessageInfo)
{
  static uint8_t l_id = 0;
  do
  {
    APP_DBG("--> APP_THREAD_CoapDataReqHandler : l_id = %d", l_id++);
    if (otCoapMessageGetType(pMessage) != OT_COAP_TYPE_CONFIRMABLE &&
        otCoapMessageGetType(pMessage) != OT_COAP_TYPE_NON_CONFIRMABLE)
    {
      APP_THREAD_Error(ERR_THREAD_COAP_ADD_RESSOURCE, 0);
      break;
    }

    if (otCoapMessageGetCode(pMessage) != OT_COAP_CODE_PUT)
    {
      APP_THREAD_Error(ERR_THREAD_COAP_ADD_RESSOURCE, 0);
      break;
    }

    if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &OT_BufferReceived, sizeof(OT_BufferReceived)) != sizeof(OT_BufferReceived))
    {
      APP_THREAD_Error(ERR_THREAD_MESSAGE_READ, 0);
    }
    //OT_BufferIdRead = otCoapMessageGetMessageId(pMessage);
    //APP_DBG("OT_BufferIdRead = %d", OT_BufferIdRead);
    OT_BufferIdRead++;

    APP_THREAD_CheckMsgValidity();

    if (otCoapMessageGetType(pMessage) == OT_COAP_TYPE_CONFIRMABLE)
    {
      APP_THREAD_SendDataResponse(pMessage, pMessageInfo);
    }
  } while (false);
}

/**
 * @brief This function acknowledge the data reception by sending an ACK
 *    back to the sender.
 * @param  pRequestHeader coap header
 * @param  pMessageInfo message info pointer
 * @retval None
 */
static void APP_THREAD_SendDataResponse(otMessage    * pMessage,
    const otMessageInfo * pMessageInfo)
{
  otError  error = OT_ERROR_NONE;

  APP_DBG("APP_THREAD_SendDataResponse");
  
  pOT_MessageResponse = otCoapNewMessage(NULL, NULL);
  if (pOT_MessageResponse == NULL)
  {
    APP_THREAD_Error(ERR_NEW_MSG_ALLOC,error);
  }
  
  error = otCoapMessageInitResponse(pOT_MessageResponse,
      pMessage,
      OT_COAP_TYPE_ACKNOWLEDGMENT,
      OT_COAP_CODE_CHANGED);

  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_COAP_MESSAGE_INIT_RESPONSE,error);
  }

  error = otCoapSendResponse(NULL, pOT_MessageResponse, pMessageInfo);
  if (error != OT_ERROR_NONE && pOT_MessageResponse != NULL)
  {
    otMessageFree(pOT_MessageResponse);
    APP_THREAD_Error(ERR_THREAD_DATA_RESPONSE,error);
  }
}

/**
 * @brief This function is used to handle the APP_THREAD_AskProvisioning handler
 *
 * @param pContext : Context
 * @param pHeader header pointer
 * @param pMessage message pointer
 * @param pMessageInfo message info pointer
 * @retval None
 */
static void APP_THREAD_ProvisioningReqHandler(void                * pContext,
                                              otMessage           * pMessage,
                                              const otMessageInfo * pMessageInfo)
{
  APP_DBG("**** STEP 2: Receives Provisioning request *****");
  if (otCoapMessageGetType(pMessage) == OT_COAP_TYPE_CONFIRMABLE)
  {
    if (APP_THREAD_ProvisioningRespSend(pMessage, pMessageInfo) != OT_ERROR_NONE)
    {
      APP_THREAD_Error(ERR_PROVISIONING_RESP, 0);
    }
  }
}

/**
 * @brief This function is used to handle the APP_THREAD_AskProvisioning response
 *
 * @param pRequestHeader
 * @param pMessageInfo message info pointer
 * @retval error code
 */
static otError APP_THREAD_ProvisioningRespSend(otMessage    * pMessage,
    const otMessageInfo * pMessageInfo)
{
  otError  error = OT_ERROR_NONE;
  do{
    APP_DBG("********* STEP 3: Provisioning Send Response *********");

    pOT_MessageResponse = otCoapNewMessage(NULL, NULL);
    if (pOT_MessageResponse == NULL)
    {
      APP_DBG("WARNING : pOT_MessageResponse = NULL ! -> exit now");
      break;
    }

